backend/controllers/FrontendController.php

UPDATE `record_pensions` SET `all_pensions`=`all_pensions`+1 WHERE `id`=2
---
    public function actionRecordPensions()
    {
        $user_id = $this->user_id;
        $RecordList = (new RecordPensions())->getRecordList($user_id); //获取已经该员工已经交了多少个月养老金
        $PensionsList = (new CollectPensions())->getPensionsList($user_id); //获取上缴养老金列表
        $last_record = (new CollectPensions())->getLastPensions($user_id);//计算两次上缴养老金月数差
        $last_record_time = strtotime($last_record['create_time']);
        $diff_data = (int)((time() - $last_record_time) / 86400);
        if ($diff_data > 30)
            $can_use = 1;
        else
            $can_use = 0;
        $post = Yii::$app->request->post();
        if (!empty($post)) {
            $staff_info = (new StaffInfo())->getStaffInfo($user_id);
            if (isset($staff_info[0])) {
                $refer_pension = $staff_info[0]['pay'] * 0.02;//上缴养老金 按工资的 %2 来上缴
                $data = [
                    'user_id' => $user_id,
                    'salary' => $staff_info[0]['pay'],
                    'refer_pension' => $refer_pension
                ];
                (new CollectPensions())->savePensions($data);
                $update_record = (new RecordPensions())::findOne(['user_id' => $user_id]);
                $update_record->updateCounters(['all_pensions' => 1]); //更新已经提交的养老金月数