backend/controllers/SiteController.php

SELECT * FROM `user` WHERE id=26
---
    public function actionIndex()
    {
        /**
         * 用session 保存用户名
         */
        $user_info=Yii::$app->getUser()->getId();
        $user_info=(new User())->find()->where('id='.$user_info)->asArray()->one();