common/models/LoginForm.php

SELECT * FROM `staff_info` WHERE user_id=26
---
    public function validatePassword($attribute, $params)
    {
        if (!$this->hasErrors()) {
            $user = $this->getUser();
            $result=(New StaffInfo())->find()->where('user_id='.$user->getId())->asArray()->one();