backend/models/Assessment.php

    public function getAssessmentListByOtherId($user_id)
    {
        $query = static::find()->where(['and',['other_id'=>$user_id],['!=','evaluation','']]);
        $count = $query->count();
---
SELECT COUNT(*) FROM `assessment` WHERE (`other_id`=27) AND (`evaluation` != '')