backend/models/AssessmentLog.php

SELECT avg(score) as avg_score, `standard_id` FROM `assessment_log` WHERE `user_id`=27 GROUP BY `standard_id`
---
    public function getAssessmentLog($id)
    {
        return static::find()->select('avg(score) as avg_score,standard_id')->where(['user_id'=>$id])->groupBy('standard_id')->asArray()->all();