backend/models/AsssessmentStandard.php

    public function getStandardList()
    {
        return static::find()->asArray()->all();
---
SELECT * FROM `asssessment_standard`