backend/models/CollectPensions.php

SELECT COUNT(*) FROM `collect_pensions` WHERE `user_id`=27
---
    public function getPensionsList($id)
    {
        $query = static::find()->where(['user_id' => $id]);
        $count = $query->count();

SELECT SUM(a) FROM (SELECT sum(refer_pension) as a FROM `collect_pensions` WHERE user_id=27 GROUP BY `user_id`) `c`
---
    public function SumPensions($id)
    {
        $data=static::find()->select(["sum(refer_pension) as a" ])->groupBy('user_id')->where('user_id='.$id)->sum('a');

INSERT INTO `collect_pensions` (`user_id`, `salary`, `refer_pension`, `create_time`) VALUES (27, '5000', '100', '2018-02-24 10:10:10')
---
    public function savePensions($data)
    {
        $collect_pensions=new CollectPensions();
        $collect_pensions->user_id=$data['user_id'];
        $collect_pensions->salary=$data['salary'];
        $collect_pensions->refer_pension=$data['refer_pension'];
        $collect_pensions->create_time=date('Y-m-d H:i:s',time());
        $collect_pensions->save();