backend/models/GetPension.php

SELECT COUNT(*) FROM `get_pension` WHERE `user_id`=27
---
    public function getPensionsList($id)
    {
        $query = static::find()->where(['user_id' => $id]);
        $count = $query->count();

INSERT INTO `get_pension` (`user_id`, `get_pension`, `create_time`) VALUES (27, '1', '2018-02-24 10:17:15')
---
    public function savePensions($array=[])
    {
        $Recruitment=new GetPension();
        $Recruitment->user_id = $array['user_id'];
        $Recruitment->get_pension = $array['get_pension'];
        $Recruitment->create_time = date('Y-m-d H:i:s',time());
        return $Recruitment->save();