backend/models/Punishment.php

    public function getPunishmentList($id)
    {
        $query = static::find()->where(['user_id' => $id]);
        $count = $query->count();
        $pagination = new Pagination(['totalCount' => $count,'pageSize'=>2]);
        $list = $query->offset($pagination->offset)->limit($pagination->limit)->asArray()->all();
---
SELECT COUNT(*) FROM `punishment` WHERE `user_id`=27
SELECT * FROM `punishment` WHERE `user_id`=27 LIMIT 2