backend/models/Recruitment.php

    public function getRecruitment($id)
    {
        $query = static::find();
        $count = $query->count();
        $pagination = new Pagination(['totalCount' => $count,'pageSize'=>2]);
        $list = $query->offset($pagination->offset)->limit($pagination->limit)->orderBy('create_time desc')->asArray()->all();
---
SELECT COUNT(*) FROM `recruitment`
SELECT * FROM `recruitment` ORDER BY `create_time` DESC LIMIT 2