backend/models/StaffInfo.php

    public function getStaffInfo($id)
    {
      return static::find()->where(['user_id'=>$id])->asArray()->all();
---
SELECT * FROM `staff_info` WHERE `user_id`=27

    public function getStaffList($id)
    {
        return static::find()->where('user_id!='.$id)->asArray()->all();
---
SELECT * FROM `staff_info` WHERE user_id!=27