backend/models/StaffTransfer.php

    public function getStaffTransferInfo($id)
    {
        return static::find()->where('user_id='.$id)->orderBy('create_time desc')->asArray()->all();
---
SELECT * FROM `staff_transfer` WHERE user_id=27 ORDER BY `create_time` DESC