backend/models/User.php

SELECT * FROM `user` WHERE `email`='12345@qq.com'
---
    public function findByEmail($email)
    {
        return static::find()->where(['email' => $email])->asArray()->one();

SELECT * FROM `user` WHERE id=27
---
    public function getUserName($id)
    {
        return static::find()->where('id='.$id)->asArray()->one();

SELECT * FROM `staff_info` WHERE `user_id`='27'
SELECT * FROM `user` WHERE id=27
---
    public function getUserInfo($id)
    {
        return static::find()->where('id='.$id)->with('staffinfo')->asArray()->one();